---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetSetIterator.Current
source: html/bd83f239-51a5-9b1d-184b-07a0aeea9d7a.htm
---
# Autodesk.Revit.DB.Visual.AssetSetIterator.Current Property

## Syntax (C#)
```csharp
public virtual Object Current { get; }
```